# 	////////////////////////////////////////////////////////////
# 	Циклы. (loop) //////////////////////////////////////////////

#	Цикл while .................................................

#	Выполняет тело цикла до тех пор, пока условие цикла истинно.

	i = 5
	
	while i < 15:
		print(i)	# 5, 7, 9, 11, 13
	    i = i + 2	

#	Цикл for ...................................................

#	Цикл for выполняется гораздо быстрее цикла while. Этот цикл 
#	проходится по любому итерируемому объекту (например строке 
#	или списку), и во время каждого прохода выполняет тело цикла.

	for i in 'hello world':
    	print(i * 2, end='')	# hheelllloo  wwoorrlldd

#	Оператор continue ..........................................

#	Оператор continue начинает следующий проход цикла, минуя 
#	оставшееся тело цикла (for или while)

	for i in 'hello world':
		if i == 'o':
			continue
		print(i * 2, end='')	# hheellll  wwrrlldd

#	Оператор break .............................................

#	Оператор break досрочно прерывает цикл.

	for i in 'hello world':
		if i == 'o':
			break
		print(i * 2, end='')	# hheellll

#	Else .......................................................

#	Слово else, примененное в цикле for или while, проверяет, 
#	был ли произведен выход из цикла инструкцией break, или же 
#	"естественным" образом. Блок инструкций внутри else выполнится 
#	только в том случае, если выход из цикла произошел без помощи 
#	break.

#	Конструкция for-else

	for i in 'hello world':
		if i == 'a':
			break
	else:
		print('Буквы a в строке нет')	# Буквы a в строке нет


#	while ::::::::::::::::::::::::::::::::::::::::::::::::::::

while True:
	reply = input('Hellow, your name? ')
	if reply == 'stop': break
	print('Good name:', reply.upper())
	if reply == 'next': continue

#	for ::::::::::::::::::::::::::::::::::::::::::::::::::::::

#	применение к строкам .....................................

x = 'test'
for c in x: print(c, end=' ')

#	применение к картежам ....................................

x2 = ('zaza', '123', x)
for c in x2: print(c, end=', ')

#	применение к спискам .....................................

x3 = [(1, 2), (3, 4), (5, 6)]
for (a, b) in x3:
	print(a, b)

#	применение к словарям ....................................

x4 = {'a': 1, 'b': 2, 'c': 3}

for key in x4:
	print(key, '=>', x4[key])

#	обход ключей и значений одновременно
for (key, value) in x4.items():
	print(key, '=>', value)

#	применгение к файлам ....................................

for lalka in open('test.py').readline():
	print(lalka, end='')
