iterators :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Итераторы - это классы, генерирующие последовательности каких-либо 
# значений. Такие классы мы можем задействовать, например, в циклах for

# объект считается итерируемым, либо если он физически является 
# последовательностью, либо если он является объектом, который 
# воспроизводит по одному результату за раз в контексте инструментов 
# выполнения итераций, таких как цикл for. В некотором смысле в категорию 
# итерируемых объектов входят как физические последовательности, так и  
# последовательности виртуальные, которые вычисляются по требованию.

# документация на английском:
# 

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
