# Простая полудуплексная программа интерактивной переписки. Под 
# полудуплексной подразу­мевается то, что после создания соединения 
# и начала работы службы толь­ко один из участников переписки может 
# вводить свое сообщение. Другой участник должен ожидать поступления 
# сообщения, поскольку лишь после этого перед ним появится 
# приглашение к вводу сообщения. После отправки сообщения отправитель 
# должен ожидать ответа для получения возможно­сти отправить 
# следующее сообщение. Один из участников будет находиться на 
# стороне сервера, а второй - на стороне клиента.
