# console_messanger

# консольный мессанджер который работает в интерактивном режиме и 
# содержит следующий функционал:
# - регистрация
# - авторизация с двойной аутентификацией
# - поиск и отправка сообщений участникам с возможностью 
#	групповой отправки
# - получение системных уведомлений
# - получение почтовых уведомлений
# - распечатка сообщений в формате xlsx
# - автоматическое формирование аватарок
# - просмотр своей и чужих аватарок
# - вызов помощи
# - установка программы через pip

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# использование:

# авторизация и регистрация:
# при запуске программа запросит авторизаваться, если вы не 
# зарегестрированны введёте 'rg', и она перенаправит вас на 
# регистрацию. Регистрация проходит в интерактивном режиме