Pillow :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Библиотека для работы с изображениями

# документация на английском:
# https://pillow.readthedocs.io/en/5.0.0/

# установка:
pip install pillow

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

from PIL import *

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

ImageColor
	getcolor('red', 'RGBA')
	# получаем кортеж из цифровой комбинации данного цвета, не 
	# чуствительна к регистру

ImageFilter
#

ImageEnhance
#

ImageSequence
#

PSDraw
#

ImageDraw
#

ImageFont
#

Image
# 