sqlite3 :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Эта библиотека написанная на языке C, которая предоставляет 
# легковесную, находящуюся на диске базу данных, которой не 
# требуется отдельный серверный процесс и которая позволяет 
# получать доступ используя не стандартные диалекты языка SQL. 
# Некоторые приложения могут использовать SQLite для внутреннего 
# хранения данных. Также возможно сделать прототип приложения 
# используя SQLite и затем перенести код для больших баз данных, 
# таких как PostgreSQL или Oracle.

# документация на английском:
# https://docs.python.org/3/library/sqlite3.html

# документация на русском:
# http://john16blog.blogspot.com.by/2011/03/python-sqlite3.html

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

import sqlite3

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

