Pythom modules :::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# встроенные :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

email 
# Пакет, который может применяться для обработки электронной почты 
# (поддер­живает также MIME)

smtpd
# Сервер SMTP

base64
# Средства кодирования данных по основанию 16, 32 и 64

mhlib
# Классы для обработки папок и сообщений МН

mailbox
# Классы для обеспечения синтаксического анализа форматов файлов 
# почтового ящика

mailcap
# Поддержка средств обработки файлов mailcap

mimetypes
# Средства преобразования имен файлов/URL и соответствующих типов 
# MIME

quopri
# Средства кодирования и декодирования данных типа quoted-printable 
# стандар­та MIME

binascii
# Средства преобразования двоичного кода и кода ASCII

binhex
# Средства поддержки кодирования и декодирования текста в формате 
# Binhex4

dbm
# просто хранилище ключ - значение

shelve
# Используя модуль shelve, можно сохранять переменные в двоичных 
# файлах-хранилищах.

sqlite3
# Простая реляционная база данных

datetime
# Модуль для работы с датами и временем.

time
# Модуль для работы с временем

csv
# модуль для работы с файлами в формате csv

json
# модуль для работы с файлами в формате json

zipfile
# модуль для работы с файлами в формате zip

multiprocessing
#

subprocess
# 

threading
# модуль для работы с многопоточностью

_thread
# модуль для низкоуровневой работы с потоками

logging
# модуль для создание и ведения журнала отчётов на основе подготовленных 
# сообщений

glob
#

os
#

re
# модуль для работы с регулярными выражениями

shutil
#

socket
# модуль обеспечивает доступ к интерфейсу сокетов BSD

socketserver
# назначение состоит в предоставлении большого объёма стандартного кода, 
# необходимого для создания сетевых клиентов и серверов. Этот модуль 
# обеспечивает создание от имени пользователя различных классов.

struct
# используется для преобразования данных на языке python в структуры 
# двоичных данных, представленные как строки байтов и наоборот.

sys
#

ftplib
# модуль для работы с ftp протоколом, который используется для передачи
# файлов по сети.

urllib
#

imaplib
# модуль для работы с imap протоколом, который используется для приёма
# электронных сообщений

nntplib
# модуль для работы с nntp протоколом, который используется для 
# публикации, а также чтение новостной ленты (Usenet)

smtplib
# модуль для работы с smtp протоколом, который используется для
# отправки электронной почты.

xmlrpclib
# клиент протокола XML-RPC

hhtplib
# клиент протокола HTTP и HTTPS

poplib
# клиент протокола POP3

collections
#

pprint
#

webbrowser
# предназначен для автоматического открытия браузеров с заданным url

heapq
#

random
#




# трубуют установки ::::::::::::::::::::::::::::::::::::::::::::::::::::

openpyxl
# Может читать и изменять файлы электроных таблиц Excel

PyPDF2
# Используется для работы с PDF документами

docx
# это библиотека Python для создания и обновления файлов 
# Microsoft Word (.docx).

numpy
# модуль добавляющий поддержку больших многомерных массивов и матриц, 
# вместе с большой библиотекой высокоуровневых (и очень быстрых) 
# математических функций для операций с этими массивами.

pep8
# модуль для проверки соответствия написания кода стандарту pep8

pillow
# модуль для работы с изображениями

pyautogui
# модуль для кросс-платформенной автоматизации графического интерфейса. 
# Способен посылать сигналы виртуальных нажатий клавиш и  щелчков 
# мышью операционным системам Windows, Linux, OSX. 

requests
# упращает загрузку файлов из интернета, позволяя не задумываться
# о таких сложных вопросах, как ошибки сети, проблемы подключения
# сжатия данных

selenium
# модуль для автоматизированного управления браузерами.

BeautifulSoup
# это парсер для синтаксического разбора файлов HTML/XML

pytube
# Pytube это библиотека для скачивания видео с Youtube.

pyperclip
# модуль для работы с буфером обмена