SQLAlchemy ::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# это библиотека на языке Python для работы с реляционными СУБД с 
# применением технологии ORM. Служит для синхронизации объектов 
# Python и записей реляционной базы данных. SQLAlchemy позволяет 
# описывать структуры баз данных и способы взаимодействия с ними 
# на языке Python без использования SQL.

# документация на английском:
# http://docs.sqlalchemy.org/en/latest/

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

import sqlalchemy

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

