time :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

#

# документация на английском:
#

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

from time import *

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

time()
# возвращает кол-во секунд истекших с момента начала "Эры Unix"
# с 1 января 1970 по шкале Всемирного координированого времени

sleep(2)
# используется если требуется приостановить программу на 
# некоторое время. Аргумент принимается в секундах

ctime()
#