mixins ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Mixin- это класс, включающий какие-либо атрибуты и методы, которые 
# необ­ходимо добавить к другим классам. Объявляются они точно так же, как 
# и обычные классы. Существуют две основные ситуации, в которых 
# используются миксины:

	# Вы хотите предоставить множество дополнительных функций для класса.

	# Вы хотите использовать одну конкретную функцию во множестве разных 
	# классов.

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::


