# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
# использование в консольном режиме:

# ВЫЗОВ ПОМОЩИ:
# введите команду 'help'

# НАСТРОЙКИ:
# введите 'config' далее прогр. пройдёт по всем настройкам 
# предлагая включить или отключить. Отвечайте 'yes' или 'no'

# АВТОРИЗАЦИЯ И РЕГИСТРАЦИЯ:
# при запуске программа запросит авторизаваться, если вы не 
# зарегестрированны введёте 'rg', и она перенаправит вас на 
# регистрацию. Регистрация и авторизация проходит в 
# интерактивном режиме

# ПОИСК УЧАСТНИКОВ:
# введите команду 'users' для получения всех участников, для 
# того чтобы найти когото конкретного введите логин пользователя
# например 'Bob6799'

# ОТПРАВКА СООБЩЕНИЙ:
# введите 'send_msg' далее прогр. спросит кому, введите логин 
# получателя либо список получателей, далее прогр. перейдёт в режим 
# приёма сообщений. Которыйе можно написать в инт.реж. или вставить 
# из буфера, указав 'buf'.

# ПРОСМОТР СООБЩЕНИЙ:
# введите 'read_msg' далее прогр. предложит несколько вариантов.
# выберите необходимый. В варианты входит, просмотр в xlsx, txt, 
# bash. Затем прогр. предложит выбрать чьи сообщения необходимо 
# распечатать. 'all' - всех, 'ex_login' - пользователя конкретно

# ПРОСМОТР ПРОФИЛЯ:
# для просмотра своего профиля введите 'I am', для просмотра другого
# пользователя введите логин пользователя 'Bob6799'
 