imaplib :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Назначение протокола IMAP состоит в том, чтобы предоставить более 
# полное ре­шение по сравнению с протоколом РОР; однако этот протокол 
# сложнее, чем РОР. Преимущество IMAP состоит в том, что этот протокол 
# является чрезвычайно удоб­ным для работы в современных условиях, когда 
# пользователи обращаются к своим сообщениям электронной почты с 
# нескольких разных устройств, например, с на­стольных, переносных и 
# планшетных компьютеров, мобильных телефонов, графиче­ских игровых 
# систем и т.д.

# докуентация на английском:
# https://docs.python.org/3/library/imaplib.html

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

from imaplib import *

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::