urllib ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Это пакет, который содержит несколько модулей для работы с 
# URL-адресами

# документация на английском:
# https://docs.python.org/3/library/urllib.html

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

import urllib

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

urllib.request
# для открытия и чтения URL-адресов

urllib.error
# содержит исключения вызванные urllib.request

urllib.parse
# для парсинга URL-адресов
# смотреть папку 'parse'

urllib.robotparser
# для парсинга robots.txt файлов
